In [1]:
from sql_conn import *

In [2]:
sc = SqlConn()

In memory Connection established successfully

In [31]:
sc.query("""
        select CURRENT_TIME, CURRENT_DATE, CURRENT_TIMESTAMP
""")

  CURRENT_TIME CURRENT_DATE    CURRENT_TIMESTAMP
0     22:33:42   2020-09-29  2020-09-29 22:33:42

In [5]:
sc.query("""
        select date('2018-12-01')
""")

  date('2018-12-01')
0         2018-12-01

In [26]:
df = pd.read_pickle("data/AlleghenyCountyPropertySaleTransactions.pkl", compression='bz2')

In [36]:
sc.upload(df,"property_sale")

In [38]:
sc.query("""
          select * from 
          (select PROPERTYCITY, count(*) as cnt from property_sale  group by 1 )
          order by cnt desc          
         """)

       PROPERTYCITY     cnt
0        PITTSBURGH  160922
1        CORAOPOLIS   10359
2       MC KEESPORT    9104
3          GIBSONIA    6698
4         SEWICKLEY    6282
..              ...     ...
94         MOON TWP       1
95  N VERSAILLES          1
96        WEST VIEW       1
97        WHITE OAK       1
98          WITAKER       1

[99 rows x 2 columns]

In [39]:
sc.quit()

database connection successfully closed